# Subsetting 

Review core method to select data from a `pandas.DataFrame`

## Read in CSV 
`pandas.red_csv`

In [1]:
import pandas as pd

# read in file 

df = pd.read_csv('data/wetlands_seasonal_bird_diversity.csv')

Carp Salt marsh (CSM)
Mugu Laggon (MUL)
San Dieguito Wetland (SDW)
Tijuana Estuary (TJE)

Each location has birds surveyed durning spring, winter, and fall 
year column = year on which data was collected

In [2]:
# print df's column names 
df.columns

Index(['year', 'CSM_winter', 'CSM_spring', 'CSM_fall', 'MUL_winter',
       'MUL_spring', 'MUL_fall', 'SDW_winter', 'SDW_spring', 'SDW_fall',
       'TJE_winter', 'TJE_spring', 'TJE_fall'],
      dtype='object')

In [3]:
# list dtypes of each column 
df.dtypes

year            int64
CSM_winter    float64
CSM_spring    float64
CSM_fall      float64
MUL_winter    float64
MUL_spring    float64
MUL_fall      float64
SDW_winter    float64
SDW_spring    float64
SDW_fall      float64
TJE_winter    float64
TJE_spring    float64
TJE_fall      float64
dtype: object

In [4]:
# print the df's shape 
df.shape

(14, 13)

## Selecting a single column

Simple case: select a single column by column name 

General syntax: 
```python 
df['column_name']
```

This is an example of **label based subsetting**, which means we want to select data from our df using the names of the columns, not their postion.

### Example 
Select the number of bird species observed at Mugu Lagoon in spring

In [5]:
# select a column using square brackets 
mul_spring = df['MUL_spring']

mul_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

In [6]:
# confirm the type of output 
print(type(mul_spring))

<class 'pandas.core.series.Series'>

We can think of a pandas.dataframe as a dictionary of its columns.
Then, we can access a single column using thr column name as the *key*, just like we would in a dictionary:

`df[column_name'`

We can also do label-based subsetting of a single column using attribute syntax: 

`df.column_name`

Example:

In [7]:
df.MUL_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

Favor `df['column_name']` instead of `df.column_name`

Why?

- `df['column_name]'` avoids conflicts with `pd.DataFrames` methods and attributes. For example, if df has column name `count`, its amibigous whether `pd.count` is eferring to the `count()` method or the `count` column. 
- `df.column` only works if the column name has no spaces or special characters 
- Its important to stay consistent on what method you use during a project. 

## Selecting multiple columns ...

### ... using a list of column names 

Pass a list of column names to square brackets 
```python 
df[ ['col1', 'col2', 'col3'] ]
```

Notice the "double square brackets". This is because we are passing the list of names ``['col1', 'col2', 'col3']` to the selection brackets `[]`.

This is labeled based, rather than location based. 

### Example

In [8]:
# select columns with names `TJE_winter` and `TJE_fall`

tje_wf = df[['TJE_winter', 'TJE_fall']]

tje_wf

    TJE_winter  TJE_fall
0          NaN      81.0
1         67.0       NaN
2         70.0      69.0
3         69.0      64.0
4         60.0      62.0
5         73.0      64.0
6         76.0      58.0
7         72.0      57.0
8         66.0      55.0
9         63.0      50.0
10        54.0      54.0
11        53.0      51.0
12        60.0      60.0
13        60.0      38.0

In [9]:
print(type(tje_wf))

<class 'pandas.core.frame.DataFrame'>

If you subset more than one column, you get a dataframe.

### ... using a slice 

To select a slice of the columns we will use a special case of `loc` selection. General sytax:
```python
df.loc[ : , 'column_start':'column_end']
```

Notice: 

- the first value passed to `loc` is used for selecting rows, using a colun as the row-selection parameter means "select all the rows"
- the slice of the resulting data frame include both endpoints of the slice.

In [10]:
# select columns between 'CSM_winter' and 'MUL_fall'
csm_mul = df.loc[:, 'CSM_winter':'MUL_fall']

csm_mul.head()

   CSM_winter  CSM_spring  CSM_fall  MUL_winter  MUL_spring  MUL_fall
0        39.0        40.0      50.0        45.0         NaN      61.0
1        48.0        44.0       NaN        58.0        52.0       NaN
2        51.0        43.0      49.0        57.0        58.0      53.0
3        42.0        46.0      38.0        60.0        58.0      62.0
4        38.0        43.0      45.0        49.0        52.0      57.0

## Selecting rows...

### ... using a condition 
To select rows that satisfy a particular condtion the general syntax is 
```python
df[condition_on_rows]
```

The `condition_on_rows` can be many things, let's see some usual scenarios.

### Example 

We are interested in data after 2020.

In [11]:
# Select all rows with years > 2020
post_2020 = df[ df['year']>2020]
post_2020

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

condition for our rows = `df['year'] >2020`
This is a `pandas.Series` with boolean values True or False indicating which rows satisfy the condition year > 2020

In [12]:
# check the type of df['year'] > 2020 \
print(type(df['year']>2020))

<class 'pandas.core.series.Series'>

In [13]:
# print the boolean series 
print(df['year']>2020)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12     True
13     True
Name: year, dtype: bool

When we pass such a series of boolean vlaues to the selction brackets, we keep only the rows that correspond to a `True` value. 

## Check in 

Get the subset of the data frame on which the SDW has at least 75 species recorded during spring

In [14]:
# subset 'SDW_spring' >= 75 
sdw_spring = df[df['SDW_spring']>=75]
sdw_spring

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

# Wednesday Oct 9th lecture 

#### Example 

We want to look at data from years 2012 to 2015 including both years. We can use the `between` method:

In [15]:
subset = df[ df['year'].between(2012,2015)]
subset

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0
5,2015,44.0,42.0,45.0,58.0,50.0,51.0,71.0,61.0,65.0,73.0,76.0,64.0

Lets break it down:

1. df['year'] = column with the year values; a `pandas.Series`
2. in `df['year'].between()` we are accessing a mehtod for the `pandas.Series` using `.`
3. (2012, 2015) = parameters, this includes both endpoints 
4. Remember `df['year'].between(2012,2015)` is a `pd.Series` of boolean values indicating which rows have a year between (and inlcuding) the years we provided
5. When we put `df['year'].between(2012,2015)` inside the selection bracket, we obtain the rows we wanted to select

## Avoid using `loc` for selecting only rows

It is equvalent to write:

In [17]:
# Select rows with year <2015
df[df['year']<2015]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

In [18]:
# Select rows with rows year<2015 using loc 
df.loc[df['year']<2015, :]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

We prefer the first syntax because it is simpler.

## Using multiple conditions 

Wew can combine multiple condtions to select rows by surrounding each condition in parenthesis `()` and usinf the or operator `|` and the and operator `&`.

### Example: OR
Select rows in which CSM has more than 50 species registered in winter *or* fall:

In [19]:
df[ (df['CSM_winter']>50) | (df['CSM_fall']>50)]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

### Example: AND 
Select rows in which both the CSM and SDW have more than 60 species during spring

In [21]:
df[ (df['CSM_spring']>60) & (df['SDW_spring']>60)]

Empty DataFrame
Columns: [year, CSM_winter, CSM_spring, CSM_fall, MUL_winter, MUL_spring, MUL_fall, SDW_winter, SDW_spring, SDW_fall, TJE_winter, TJE_spring, TJE_fall]
Index: []

Empty data frame! No rows satisfy the conditions. 

## Select rows by position 

Sometime we want to do postion based subseting of rows. 

To do this, we us **.iloc select** syntax: 

```python
df.iloc[row-indices]
```

`.iloc` = stands for interger location based indexing 

### Example:

In [22]:
# Select the 5th row (index = 4)
df.iloc[4]

year          2014.0
CSM_winter      38.0
CSM_spring      43.0
CSM_fall        45.0
MUL_winter      49.0
MUL_spring      52.0
MUL_fall        57.0
SDW_winter      61.0
SDW_spring      78.0
SDW_fall        71.0
TJE_winter      60.0
TJE_spring      81.0
TJE_fall        62.0
Name: 4, dtype: float64

In [23]:
# Select rows 9 through 13 (including 13)
df.iloc[9:14]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
9,2019,39.0,39.0,40.0,57.0,52.0,53.0,54.0,55.0,53.0,63.0,54.0,50.0
10,2020,46.0,NaN,47.0,56.0,NaN,66.0,57.0,NaN,58.0,54.0,40.0,54.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

## Selecting rows and columns simultaneously 

Can be done using `loc` (labels) or `iloc` (position)

### .... by labels or conditions
When we want to select rows and columns simultaneously by labels (including using conditions) we can use `loc` selection with the syntax

Example: Select winter surveys from MUL and TJE after 2020

In [25]:
df.loc[df['year']>2020, ['MUL_winter','TJE_winter']]

    MUL_winter  TJE_winter
11        54.0        53.0
12        60.0        60.0
13        72.0        60.0

Lets break down this code:

we are using the `df.loc[ row-selection , column-selection]` syntax

the `row-selection` parameter is the condition `df['year']>2020`, which is a boolean array saying which years are greater than 2020

the `column-selection` parameter is ``['MUL_winter','TJE_winter']``, which is a list with the names of the two columns we are interested in.

### by position
When we want to select rows and columns simultaneously by position we use `iloc` selection with the syntax:
```python
df.iloc[ row-indices , column-indices]
```

Suppose we want to select rows 3-7 (including 7) and columns 4 and 5:

In [26]:
df.iloc[3:8, [3,4]]

   CSM_fall  MUL_winter
3      38.0        60.0
4      45.0        49.0
5      45.0        58.0
6      47.0        63.0
7      43.0        57.0

## Notes about `loc` and `iloc`

### Which one does what? 
Remember the `i` in `iloc` stands for integer location, this reminds us iloc only uses integer indexing to retrieve information from the data frames in the same way as indexing for Python lists.


### `iloc` for columns selection? Avoid it!
Unless you are really looking for information about the nth column, do not access a column by position. This method is not explict and can be prone to error. It can break if the dataset is ever updated. 

**Accessing columns by labels helps reproducibility!**